tap 'homebrew/bundle'

brew 'coreutils'
brew 'curl'
brew 'dnsmasq'
brew 'git'
brew 'glib'
brew 'gpg'
brew 'htop'
brew 'ncdu'
brew 'nvm'
brew 'openssl'
brew 'postgresql'
brew 'python'
brew 'readline'
brew 'sqlite'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'utf8proc'
brew 'vim'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

