# Location of cask apps
cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'coreutils'
brew 'curl'
brew 'dnsmasq'
brew 'gcc'
brew 'git'
brew 'glib'
brew 'gpg'
brew 'htop'
brew 'ncdu'
brew 'nvm'
brew 'openssl'
brew 'postgresql'
brew 'python'
brew 'readline'
brew 'sqlite'
brew 'terminal-notifier'
brew 'thefuck'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'utf8proc'
brew 'vim'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

cask 'affinity-designer'
cask 'alfred'
cask 'brave-browser'
cask 'discord'
cask 'docker'
cask 'google-chrome'
cask 'hey'
cask 'homebrew/cask-versions/firefox-developer-edition'
cask 'iterm2'
cask 'joplin'
cask 'krita'
cask 'nextcloud'
cask 'obs'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'tunnelblick'
cask 'vlc'
cask 'visual-studio-code'
