# Location of cask apps
cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'thoughtbot/formulae'
tap 'homebrew/services'
tap 'homebrew/bundle'

brew 'ansible'
brew 'asdf'
brew 'az'
brew 'coreutils'
brew 'curl'
brew 'dnsmasq'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gawk'
brew 'gcc'
brew 'gh'
brew 'git'
brew 'glab'
brew 'glib'
brew 'gnu-sed'
brew 'gpg'
brew 'helm'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'k9s'
brew 'kubectl'
brew 'kubectx'
brew 'libyaml'
brew 'libpq'
brew 'ncdu'
brew 'openssl'
brew 'postgresql@15'
brew 'procs'
brew 'python'
brew 'qemu'
brew 'readline'
brew 'redis'
brew 'ripgrep'
brew 'sd'
brew 'shared-mime-info'
brew 'sops'
brew 'spaceship'
brew 'sqlite'
brew 'streamlink'
brew 'terminal-notifier'
brew 'thefuck'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'utf8proc'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'yt-dlp'
brew 'zoxide'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

cask 'android-file-transfer'
cask 'affinity-designer'
cask 'alfred'
cask 'astropad'
cask 'brave-browser'
cask 'balenaetcher'
cask 'chatterino'
cask 'discord'
cask 'docker'
cask 'fig'
cask 'gimp'
cask 'google-chrome'
cask 'hey'
cask 'homebrew/cask-versions/firefox-developer-edition'
cask 'iterm2'
cask 'jellyfin-media-player'
cask 'krita'
cask 'minecraft'
cask 'obs'
cask 'obsidian'
cask 'onlyoffice'
cask 'postman'
cask 'seafile-client'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'transmit'
cask 'tunnelblick'
cask 'utm'
cask 'vlc'
cask 'vscodium'
cask 'visual-studio-code'
